/*
 * VOFA.h
 *
 *  Created on: 2023年10月13日
 *      Author: jzy
 */

#ifndef VOFA_H_
#define VOFA_H_


// --------------------------------------
// 头文件
// --------------------------------------
#include "F28x_Project.h"

// --------------------------------------
// 宏定义
// --------------------------------------

// 定义通道数
#define CH_COUNT 2  // 定义通道 0

// 数据格式
struct VOFAFrame {
    float ch_data[CH_COUNT];                       // ch_data为小端浮点数组，里面放着需要发送的CH_COUNT个通道
    unsigned char tail[4];                         // tail为帧尾 {0x00, 0x00, 0x80, 0x7f};
};

// --------------------------------------
// 自定义变量
// --------------------------------------

// --------------------------------------
// 全局变量声明
// --------------------------------------

// --------------------------------------
// 函数声明
// --------------------------------------



#endif /* VOFA_H_ */
