/*
 * f28004x_x_bar.c
 *
 *  Created on: 2023年5月15日
 *      Author: jzy
 */

//
// Included Files
//
#include "f28004x_device.h"
#include "f28004x_examples.h"




// 自己添加的函数
/* --------------------------------------------------------------
 * 用户根据自己的实际需求修改
 * --------------------------------------------------------------*/

/* ----------------------------------------------------------------------------
 * Input X-BAR
 * 共 16 个 Input 选择
 * 9.1 Input X-BAR P_966
 * ----------------------------------------------------------------------------
 * ----------------------------------------------------------------------------*/
void Init_InputXbar(void){

    EALLOW;
    InputXbarRegs.INPUT5SELECT = INPUT_XBAR_GPIO0; // 选择 INPUT5 为 GPIO0
    EDIS;
}
